In [1]:
import pandas as pd
import numpy as np

In [2]:
products = pd.read_csv("/Users/kamilw/Desktop/Moje/PythonLearing/Pandas_Udemy/course-files/northwind-mongo-master/products.csv",
                      usecols=["ProductID","ProductName"])

In [3]:
orderProducts = pd.read_csv("/Users/kamilw/Desktop/Moje/PythonLearing/Pandas_Udemy/course-files/northwind-mongo-master/order-details_del.csv",
                           usecols=['OrderID','ProductID','UnitPrice','Quantity'])

In [4]:
products.head()

   ProductID                   ProductName
0          1                          Chai
1          2                         Chang
2          3                 Aniseed Syrup
3          4  Chef Anton's Cajun Seasoning
4          5        Chef Anton's Gumbo Mix

In [5]:
orderProducts.head()

   OrderID  ProductID  UnitPrice  Quantity
0    10331         54        5.9        15
1    10332         18       50.0        40
2    10332         42       11.2        10
3    10332         47        7.6        16
4    10333         14       18.6        10

In [6]:
# jak pokazać coś czego nie ma, produkty, które się nie sprzedały

In [8]:
merged = products.merge(right=orderProducts, on="ProductID", how='outer', indicator=True)

In [9]:
merged.head()

   ProductID ProductName  OrderID  UnitPrice  Quantity _merge
0          1        Chai  10348.0       14.4      15.0   both
1          1        Chai  10354.0       14.4      12.0   both
2          1        Chai  10370.0       14.4      15.0   both
3          1        Chai  10406.0       14.4      10.0   both
4          1        Chai  10413.0       14.4      24.0   both

In [10]:
merged["_merge"].value_counts()
# 289 produktow w products i orderProducts
# 5 produktow tylko w magazynie
# 0 tylko sprzedanych

both          289
left_only       5
right_only      0
Name: _merge, dtype: int64

In [11]:
filter = merged["_merge"] == 'left_only'

In [12]:
merged[filter]

,ProductID,ProductName,OrderID,UnitPrice,Quantity,_merge
16,6,Grandma's Boysenberry Spread,NaN,NaN,NaN,left_only
38,15,Genen Shouyu,NaN,NaN,NaN,left_only
85,27,Schoggi Schokolade,NaN,NaN,NaN,left_only
242,66,Louisiana Hot Spiced Okra,NaN,NaN,NaN,left_only
243,67,Laughing Lumberjack Lager,NaN,NaN,NaN,left_only

In [ ]:
# outer merge
# example: not existing data
# on='column(s) name(s)'
# how='outer'
# indicator=True
# filter = merged["_merge"] == 'left_only'
# result[filter]